NVIDIA/OpenSMA/src/sys/mcxn556/sys/i3c/driver.cpp
/*
 * SPDX-FileCopyrightText: Copyright (c) 2025 NVIDIA CORPORATION & AFFILIATES.
 * All rights reserved.
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include "nv/i3c/driver.h"

#include <algorithm>
#include <cstring>
#include <fsl_debug_console.h>

#include "nv/i3c/task.h"
#include "nv/logger/log.h"
#include "nv/nv.h"
#include "fsl_i3c_edma.h"
#include "sys/smartdma/driver.h"

namespace {

static void ibi_callback([[maybe_unused]] I3C_Type* base,
                         i3c_master_edma_handle_t*  handle,
                         i3c_ibi_type_t             ibi_type,
                         i3c_ibi_state_t            ibi_state)
{
    auto& driver = *static_cast<nv::i3c::Driver*>(handle->userData);
    if (ibi_state != kI3C_IbiReady) {
        nv::logger::Logger::add_from_isr(nv::logger::Event::I3CIgnoreIbiState.unique_id,
                                         nv::logger::Level::Info,
                                         {static_cast<uint8_t>(ibi_state)});
        return;
    }
    switch (ibi_type) {
        case kI3C_IbiNormal: driver.on_ibi(static_cast<void*>(handle)); break;
        default:
            nv::logger::Logger::add_from_isr(nv::logger::Event::I3CIgnoreIbiType.unique_id,
                                             nv::logger::Level::Info,
                                             {static_cast<uint8_t>(ibi_type)});
            return;
    }
}

static void i3c_callback(I3C_Type*                 base,
                         i3c_master_edma_handle_t* handle,
                         status_t                  status,
                         [[maybe_unused]] void*    user_data)
{
    using namespace nv;
    auto& driver = *static_cast<i3c::Driver*>(handle->userData);
    switch (status) {
        case kStatus_Success:
            if (handle->transfer.direction == kI3C_Read) {
                EDMA_StopTransfer(handle->rxDmaHandle);
                size_t length = 0;
                I3C_MasterTransferGetCountEDMA(base, handle, &length);
                handle->transferCount = length;
                I3C_MasterGetFifoCounts(handle->base, &length, nullptr);
                while (length > 0) {
                    // coverity[cert_int31_c_violation] MRDATAB FIFO read one byte a time
                    static_cast<uint8_t*>(
                        handle->transfer.data)[handle->transferCount++] = handle->base->MRDATAB;
                    length--;
                }
                EDMA_AbortTransfer(handle->rxDmaHandle);
                if (handle->transfer.flags & kI3C_TransferNoStopFlag) {
                    (void)I3C_MasterStop(base);
                }
            }
            driver.set_event(i3c::Driver::Event::Success);
            break;
        case kStatus_I3C_Nak:
#if 0
            // Only log when 5 retry failed case
            logger::Logger::add_from_isr(logger::Event::I3CNack,
                                         logger::Level::Info,
                                         {static_cast<uint8_t>(handle->state)});
#endif
            EDMA_AbortTransfer(handle->rxDmaHandle);

            /* Reset fifos. These flags clear automatically. */
            base->MDATACTRL |= I3C_MDATACTRL_FLUSHTB_MASK | I3C_MDATACTRL_FLUSHFB_MASK;
            driver.set_event(i3c::Driver::Event::Nack);
            break;
        case kStatus_I3C_IBIWon: break;
        // coverity[unterminated_case] expected no break
        case kStatus_I3C_Timeout:
#if 0
            // Only log when 5 retry failed case
            logger::Logger::add_from_isr(logger::Event::I3CTimeout,
                                         logger::Level::Info,
                                         {static_cast<uint8_t>(handle->state)});
#endif
            EDMA_AbortTransfer(handle->rxDmaHandle);

            /* Reset fifos. These flags clear automatically. */
            base->MDATACTRL |= I3C_MDATACTRL_FLUSHTB_MASK | I3C_MDATACTRL_FLUSHFB_MASK;

            /* Send a stop command to finalize the transfer. */
            (void)I3C_MasterStop(base);
            // TODO : Add break due to "warning: this statement may fall through
            // [-Wimplicit-fallthrough=]"
            break;
        default:
            driver.set_event(i3c::Driver::Event::Error);
            if (driver._error_log_count < i3c::Driver::ErrorLogThreshold) {
                driver._error_log_count++;
                // coverity[cert_int31_c_violation] log raw value
                logger::Logger::add_from_isr(
                    logger::Event::I3CUnhandledError.unique_id,
                    logger::Level::Info,
                    logger::data_from_u32(static_cast<uint32_t>(status)));
            }
    }
}

}  // namespace

nv::i3c::Driver::Driver(
    Port port, Freq freq, bool is_gpu, void* task, nv::ipc::EventId event_id)
: sys::i3c::Driver()
, _port(port)
, _task(task)
, _event(nv::ipc::Event::make(event_id))
, _is_gpu(is_gpu)
{
#ifdef CPU_MCXN556SCDF
    static_assert(nv::ipc::EnableSmartDMA, "SmartDMA is not enabled for MCXN556SCDF");
#endif
    I3C_MasterGetDefaultConfig(&_master_config);
    _master_config.baudRate_Hz.i2cBaud          = freq.i2c;
    _master_config.baudRate_Hz.i3cPushPullBaud  = freq.i3c_pp;
    _master_config.baudRate_Hz.i3cOpenDrainBaud = freq.i2c_od;
    _master_config.enableOpenDrainStop          = false;
    _master_config.disableTimeout               = true;
    // CX8 uses 50:50 duty cycle
    _master_config.enableOpenDrainHigh = is_gpu ? true : false;

    DMA_Type* dma            = nullptr;
    uint32_t  dma_tx_channel = 0;
    uint32_t  dma_rx_channel = 0;
    int32_t   dma_tx_mux     = 0;
    int32_t   dma_rx_mux     = 0;
    switch (port) {
        case Port::Zero:
            _base          = I3C0;
            dma            = DMA0;
            dma_tx_channel = 0;
            dma_rx_channel = 1;
            dma_tx_mux     = kDma0RequestMuxI3c0Tx;
            dma_rx_mux     = kDma0RequestMuxI3c0Rx;
            break;
        case Port::One:
            _base          = I3C1;
            dma            = DMA1;
            dma_tx_channel = 0;
            dma_rx_channel = 1;
            dma_tx_mux     = kDma1RequestMuxI3c1Tx;
            dma_rx_mux     = kDma1RequestMuxI3c1Rx;
            break;
        default: nv::info("unsport port %d\n", port); return;
    }
    // init controller
    EDMA_CreateHandle(&_tx_edma_handle, dma, dma_tx_channel);
    EDMA_CreateHandle(&_rx_edma_handle, dma, dma_rx_channel);
    EDMA_SetChannelMux(dma, dma_tx_channel, dma_tx_mux);
    EDMA_SetChannelMux(dma, dma_rx_channel, dma_rx_mux);
}

void nv::i3c::Driver::init()
{
    if (_is_init) {
        return;
    }
    const i3c_master_edma_callback_t Callback = {
        .slave2Master = nullptr, .ibiCallback = ibi_callback, .transferComplete = i3c_callback};
    I3C_MasterInit(_base, &_master_config, Clock);
    // coverity[cert_exp60_cpp_violation] waive this until I have a good solution
    I3C_MasterTransferCreateHandleEDMA(
        _base, &_i3c_m_handle, &Callback, this, &_rx_edma_handle, &_tx_edma_handle);
    _i3c_m_handle.ibiBuff = _ibi_data.data();
    _is_init              = true;
    nv::logger::info(nv::logger::Event::I3cDriverInit, {static_cast<uint8_t>(_port), true});
}

