NVIDIA/OpenSMA/src/sys/mcxn556/sys/i3c/driver.cpp
void nv::i3c::Driver::deinit()
{
    if (!_is_init) {
        return;
    }
    I3C_MasterDeinit(_base);
    _is_init = false;
    nv::logger::info(nv::logger::Event::I3cDriverInit, {static_cast<uint8_t>(_port), false});
}

bool nv::i3c::Driver::reset_daa(bool ping)
{
    constexpr uint8_t     BoradcastAddress = 0x7EU;
    constexpr uint8_t     CccRstdaa        = 0x06U;
    i3c_master_transfer_t xfer{};
    xfer.slaveAddress   = BoradcastAddress;
    xfer.subaddress     = CccRstdaa;
    xfer.subaddressSize = 1U;
    xfer.direction      = kI3C_Write;
    xfer.busType        = kI3C_TypeI3CSdr;
    xfer.flags          = kI3C_TransferDefaultFlag;
    xfer.ibiResponse    = kI3C_IbiRespNack;
    auto result         = I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer);
    if (result != kStatus_Success) {
        I3C_MasterStop(_i3c_m_handle.base);
        nv::info("fail to reset daa %d\n", result);
        if (!ping) {
            logger::info(logger::Event::I3CFailedToResetDaa, logger::data_from_u32(result));
        }
        return false;
    }
    return true;
}

bool nv::i3c::Driver::enec()
{
    constexpr uint8_t BoradcastAddress = 0x7EU;
    constexpr uint8_t CccRstdaa        = 0x00;
    constexpr uint8_t Enint            = 0x01;
    I3cBuffer         buffer{
        Enint,
    };
    i3c_master_transfer_t xfer{};
    xfer.slaveAddress   = BoradcastAddress;
    xfer.subaddress     = CccRstdaa;
    xfer.subaddressSize = 1U;
    xfer.data           = buffer.data();
    xfer.dataSize       = 1;
    xfer.direction      = kI3C_Write;
    xfer.busType        = kI3C_TypeI3CSdr;
    xfer.flags          = kI3C_TransferDefaultFlag;
    xfer.ibiResponse    = kI3C_IbiRespNack;
    auto result         = I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer);
    if (result != kStatus_Success) {
        I3C_MasterStop(_i3c_m_handle.base);
        const logger::EventData data = {
            CccRstdaa,
            static_cast<uint8_t>(result >> 0 & 0xFF),
            static_cast<uint8_t>(result >> 8 & 0xFF),
            static_cast<uint8_t>(result >> 16 & 0xFF),
            static_cast<uint8_t>(result >> 24 & 0xFF),
        };
        logger::info(logger::Event::I3CCccError, data);

        auto status = to_driver_status(static_cast<uint32_t>(result));
        if (status != Status::Success) {
            const auto& task = *static_cast<nv::i3c::Task*>(_task);
            task.record_error(static_cast<uint8_t>(status));
        }
        return false;
    }
    return true;
}

bool nv::i3c::Driver::get_status(uint8_t address, uint16_t& status)
{
    constexpr uint8_t     BoradcastAddress = 0x7EU;
    constexpr uint8_t     CccGetStatus     = 0x90U;
    constexpr uint16_t    WordMask         = 0xFFFF;
    I3cBuffer             buffer{};
    i3c_master_transfer_t xfer{};
    xfer.slaveAddress   = BoradcastAddress;
    xfer.subaddress     = CccGetStatus;
    xfer.subaddressSize = 1U;
    xfer.direction      = kI3C_Write;
    xfer.busType        = kI3C_TypeI3CSdr;
    xfer.flags          = kI3C_TransferNoStopFlag;
    xfer.ibiResponse    = kI3C_IbiRespAckMandatory;
    auto result         = I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer);
    if (result != kStatus_Success) {
        I3C_MasterEmitRequest(_i3c_m_handle.base, kI3C_RequestForceExit);
        const logger::EventData data = {
            CccGetStatus,
            static_cast<uint8_t>(result >> 0 & 0xFF),
            static_cast<uint8_t>(result >> 8 & 0xFF),
            static_cast<uint8_t>(result >> 16 & 0xFF),
            static_cast<uint8_t>(result >> 24 & 0xFF),
        };
        logger::info(logger::Event::I3CCccError, data);
        auto driver_status = to_driver_status(static_cast<uint32_t>(result));
        if (driver_status != Status::Success) {
            const auto& task = *static_cast<nv::i3c::Task*>(_task);
            task.record_error(static_cast<uint8_t>(driver_status));
        }
        return false;
    }
    memset(&xfer, 0, sizeof(xfer));
    xfer.slaveAddress = address;
    xfer.data         = buffer.data();
    xfer.dataSize     = 2;
    xfer.direction    = kI3C_Read;
    xfer.busType      = kI3C_TypeI3CSdr;
    xfer.flags        = kI3C_TransferDefaultFlag;
    xfer.ibiResponse  = kI3C_IbiRespAckMandatory;
    result            = I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer);
    if (result != kStatus_Success) {
        I3C_MasterStop(_i3c_m_handle.base);
        const logger::EventData data = {
            CccGetStatus,
            static_cast<uint8_t>(result >> 0 & 0xFF),
            static_cast<uint8_t>(result >> 8 & 0xFF),
            static_cast<uint8_t>(result >> 16 & 0xFF),
            static_cast<uint8_t>(result >> 24 & 0xFF),
        };
        logger::info(logger::Event::I3CCccError, data);
        auto driver_status = to_driver_status(static_cast<uint32_t>(result));
        if (driver_status != Status::Success) {
            const auto& task = *static_cast<nv::i3c::Task*>(_task);
            task.record_error(static_cast<uint8_t>(driver_status));
        }
        return false;
    }
    status = (buffer[0] << 8 | buffer[1]) & WordMask;
    return true;
}

bool nv::i3c::Driver::process_daa(std::span<uint8_t> address_list)
{
    /// reset list of devices
    I3C_MasterClearDeviceCount(_i3c_m_handle.base);
    /// start DAA porcess
    auto result = I3C_MasterProcessDAA(
        _i3c_m_handle.base, address_list.data(), address_list.size());
    if (result != kStatus_Success) {
        I3C_MasterStop(_i3c_m_handle.base);
        nv::info("fail to process daa %d\n", result);
        logger::info(logger::Event::I3CFailedToProcessDaa, logger::data_from_u32(result));
        return false;
    }
    /// list I3C devices
    i3c_device_info_t* list  = nullptr;
    uint8_t            count = 0;
    list                     = I3C_MasterGetDeviceListAfterDAA(_i3c_m_handle.base, &count);
    for (uint8_t index = 0; index < count; index++) {
        nv::info("I3C device [%d], vendor#: 0x%04x, part#: 0x%8x, addr: 0x%2x\n",
                 index,
                 list[index].vendorID,
                 list[index].partNumber,
                 list[index].dynamicAddr);
        nv::logger::info(nv::logger::Event::I3CSetAddr,
                         {static_cast<uint8_t>(list[index].dynamicAddr)});
    }
    if (count != address_list.size() && _is_gpu == false) {
        logger::info(logger::Event::I3CDaaMismatch, {count, address_list.size()});
        return false;
    }
    return true;
}

bool nv::i3c::Driver::write(uint8_t address, std::span<uint8_t> buffer)
{
    uint8_t               length = 0;
    i3c_master_transfer_t xfer{};
    xfer.slaveAddress  = address;
    xfer.data          = buffer.data();
    xfer.dataSize      = buffer.size();
    xfer.direction     = kI3C_Write;
    xfer.busType       = kI3C_TypeI3CSdr;
    xfer.flags         = kI3C_TransferDefaultFlag;
    xfer.ibiResponse   = kI3C_IbiRespAckMandatory;
    auto        status = transfer(&xfer, length);
    const auto& task   = *static_cast<nv::i3c::Task*>(_task);
    if (status != Status::Success) {
        if (_error_log_count < ErrorLogThreshold) {
            _error_log_count++;
            nv::logger::info(nv::logger::Event::I3CWriteFail, {static_cast<uint8_t>(status)});
        }

        task.record_error(static_cast<uint8_t>(status));
    }
    return status == Status::Success;
}

bool nv::i3c::Driver::read(uint8_t address, std::span<uint8_t> buffer, uint8_t& length)
{
    i3c_master_transfer_t xfer{};
    xfer.slaveAddress  = address;
    xfer.data          = buffer.data();
    xfer.dataSize      = buffer.size();
    xfer.direction     = kI3C_Read;
    xfer.busType       = kI3C_TypeI3CSdr;
    xfer.flags         = kI3C_TransferDefaultFlag;
    xfer.ibiResponse   = kI3C_IbiRespAckMandatory;
    auto        status = transfer(&xfer, length);
    const auto& task   = *static_cast<nv::i3c::Task*>(_task);
    if (status != Status::Success) {
        if (_error_log_count < ErrorLogThreshold) {
            _error_log_count++;
            nv::logger::info(nv::logger::Event::I3CReadFail, {static_cast<uint8_t>(status)});
        }
        task.record_error(static_cast<uint8_t>(status));
    }
    return status == Status::Success;
}

nv::i3c::Driver::Status nv::i3c::Driver::transfer(void* args, uint8_t& length)
{
    using namespace std::chrono;
    const auto&    task   = *static_cast<nv::i3c::Task*>(_task);
    const uint8_t  Retry  = 5;
    const uint32_t Mask   = Event::Success | Event::Error | Event::Nack;
    Status         status = Status::Error;
    for (uint8_t i = Retry; i > 0; i--) {
        status_t result = kStatus_Success;
        // WAR SDK API cannot be interrupted
        taskENTER_CRITICAL();
        result = I3C_MasterTransferEDMA(
            _i3c_m_handle.base, &_i3c_m_handle, static_cast<i3c_master_transfer_t*>(args));
        taskEXIT_CRITICAL();
        if (result != kStatus_Success) {
            status = Status::Busy;
            task.delay(10ms);
            continue;
        }
        auto events = _event.wait(Mask, true, false, 100ms);
        if (events.value() & Event::Success) {
            length = static_cast<uint8_t>(_i3c_m_handle.transferCount & UINT8_MAX);
            status = Status::Success;
            break;
        }
        if (events.value() & Event::Nack) {
            status = Status::Nack;
            task.delay(10ms);
            continue;
        }
        if (events.value() & Event::Error) {
            status = Status::Error;
            task.delay(10ms);
            continue;
        }
        if (!events.value()) {
            if constexpr (nv::ipc::EnableSmartDMA) {
                sys::smartdma::Driver::log_status(_i3c_m_handle);
            }
            status = Status::Timeout;
            task.delay(10ms);
        }
    }
    return status;
}

void nv::i3c::Driver::on_ibi(void* args)
{
    auto& task   = *static_cast<nv::i3c::Task*>(_task);
    auto& handle = *static_cast<i3c_master_edma_handle_t*>(args);
    if constexpr (nv::ipc::EnableSmartDMA) {
        auto instance = I3C_GetInstance(handle.base);
        auto ibi_data = sys::smartdma::Driver::get_ibi_data(instance);
        task.on_ibi(
            ibi_data->address,
            std::span<volatile uint8_t>(static_cast<volatile uint8_t*>(&ibi_data->buf[0]),
                                        static_cast<size_t>(ibi_data->payload_size)));
    }
    else {
        task.on_ibi(handle.ibiAddress,
                    std::span<uint8_t>(handle.ibiBuff, handle.ibiPayloadSize));
    }
}

void nv::i3c::Driver::set_event(Event event)
{
    (void)_event.set(event);
    // TODO error log?
}

nv::i2c::I2cStatus nv::i3c::Driver::i2c(uint8_t            address,
                                        std::span<uint8_t> write_buffer,
                                        std::span<uint8_t> read_buffer)
{
    auto result = nv::i2c::I2cStatus::Error;
    if (write_buffer.size() != 0 && read_buffer.size() == 0) {
        result = i2c_write(address, write_buffer);
    }
    else if (write_buffer.size() == 0 && read_buffer.size() != 0) {
        result = i2c_read(address, read_buffer);
    }
    else if (write_buffer.size() != 0 && read_buffer.size() != 0) {
        result = i2c_write_read(address, write_buffer, read_buffer);
    }
    else {
        /// TODO quick write/read
    }
    return result;
}

