NVIDIA/OpenSMA/src/sys/mcxn556/sys/i3c/driver.cpp
nv::i2c::I2cStatus nv::i3c::Driver::i2c_write(uint8_t address, std::span<uint8_t> buffer)
{
    i3c_master_transfer_t xfer{
        .flags        = kI3C_TransferDefaultFlag,
        .slaveAddress = address,
        .direction    = kI3C_Write,
        .data         = buffer.data(),
        .dataSize     = buffer.size(),
        .busType      = kI3C_TypeI2C,
    };
    nv::i2c::I2cStatus result = nv::i2c::I2cStatus::Ok;
    taskENTER_CRITICAL();
    auto status = I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer);
    taskEXIT_CRITICAL();
    result = to_status(status);
    if (result != nv::i2c::I2cStatus::Ok) {
        i2c_stop();
        nv::logger::info(nv::logger::Event::I3CI2CWriteFail,
                         {static_cast<uint8_t>(result), address});
        const auto& task = *static_cast<nv::i3c::Task*>(_task);
        task.record_error((static_cast<uint8_t>(to_driver_status(result))));
    }
    return result;
}

nv::i2c::I2cStatus nv::i3c::Driver::i2c_read(uint8_t address, std::span<uint8_t> buffer)
{
    i3c_master_transfer_t xfer{
        .flags        = kI3C_TransferDefaultFlag,
        .slaveAddress = address,
        .direction    = kI3C_Read,
        .data         = buffer.data(),
        .dataSize     = buffer.size(),
        .busType      = kI3C_TypeI2C,
    };
    nv::i2c::I2cStatus result = nv::i2c::I2cStatus::Ok;
    taskENTER_CRITICAL();
    result = to_status(I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer));
    taskEXIT_CRITICAL();
    if (result != nv::i2c::I2cStatus::Ok) {
        i2c_stop();
        nv::logger::info(nv::logger::Event::I3CI2CReadFail,
                         {static_cast<uint8_t>(result), address});

        const auto& task = *static_cast<nv::i3c::Task*>(_task);
        task.record_error((static_cast<uint8_t>(to_driver_status(result))));
    }
    return result;
}

nv::i2c::I2cStatus nv::i3c::Driver::i2c_write_read(uint8_t            address,
                                                   std::span<uint8_t> write_buffer,
                                                   std::span<uint8_t> read_buffer)
{
    i3c_master_transfer_t xfer{
        .slaveAddress = address,
        .busType      = kI3C_TypeI2C,
    };
    /// write phase
    xfer.direction            = kI3C_Write;
    xfer.data                 = write_buffer.data();
    xfer.dataSize             = write_buffer.size();
    xfer.flags                = kI3C_TransferNoStopFlag;
    nv::i2c::I2cStatus result = nv::i2c::I2cStatus::Ok;
    taskENTER_CRITICAL();
    result = to_status(I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer));
    taskEXIT_CRITICAL();
    if (result != nv::i2c::I2cStatus::Ok) {
        i2c_stop();
        nv::logger::info(nv::logger::Event::I3CI2CWriteFail,
                         {static_cast<uint8_t>(result), address});
        const auto& task = *static_cast<nv::i3c::Task*>(_task);
        task.record_error((static_cast<uint8_t>(to_driver_status(result))));
        return result;
    }
    /// read phase
    xfer.direction = kI3C_Read;
    xfer.data      = read_buffer.data();
    xfer.dataSize  = read_buffer.size();
    xfer.flags     = kI3C_TransferRepeatedStartFlag;
    taskENTER_CRITICAL();
    result = to_status(I3C_MasterTransferBlocking(_i3c_m_handle.base, &xfer));
    taskEXIT_CRITICAL();
    if (result != nv::i2c::I2cStatus::Ok) {
        i2c_stop();
        nv::logger::info(nv::logger::Event::I3CI2CReadFail,
                         {static_cast<uint8_t>(result), address});
        const auto& task = *static_cast<nv::i3c::Task*>(_task);
        task.record_error((static_cast<uint8_t>(to_driver_status(result))));
        return result;
    }
    return nv::i2c::I2cStatus::Ok;
}

void sys::i3c::Driver::i2c_stop()
{
    /// WAR driver didn't send stop correctly when NACK
    auto mctrl_val             = _i3c_m_handle.base->MCTRL;
    mctrl_val                 &= ~I3C_MCTRL_TYPE_MASK;
    mctrl_val                 |= I3C_MCTRL_TYPE(kI3C_TypeI2C);
    _i3c_m_handle.base->MCTRL  = mctrl_val;
    I3C_MasterEmitRequest(_i3c_m_handle.base, kI3C_RequestEmitStop);
}

nv::i2c::I2cStatus sys::i3c::Driver::to_status(status_t status)
{
    switch (status) {
        case kStatus_Success   : return nv::i2c::I2cStatus::Ok;
        case kStatus_I3C_Busy  : return nv::i2c::I2cStatus::Busy;
        case kStatus_I3C_Nak   : return nv::i2c::I2cStatus::Nak;
        case kStatus_I3C_IBIWon: return nv::i2c::I2cStatus::ArbLost;
        default                : return nv::i2c::I2cStatus::Error;
    }
}

nv::i3c::Driver::Status nv::i3c::Driver::to_driver_status(nv::i2c::I2cStatus status)
{
    switch (status) {
        case nv::i2c::I2cStatus::Ok     : return nv::i3c::Driver::Status::Success;
        case nv::i2c::I2cStatus::Busy   : return nv::i3c::Driver::Status::Busy;
        case nv::i2c::I2cStatus::Nak    : return nv::i3c::Driver::Status::Nack;
        case nv::i2c::I2cStatus::Timeout: return nv::i3c::Driver::Status::Timeout;
        default                         : return nv::i3c::Driver::Status::Error;
    }
}

nv::i3c::Driver::Status nv::i3c::Driver::to_driver_status(uint32_t status)
{
    switch (status) {
        case kStatus_Success    : return nv::i3c::Driver::Status::Success;
        case kStatus_I3C_Busy   : return nv::i3c::Driver::Status::Busy;
        case kStatus_I3C_Nak    : return nv::i3c::Driver::Status::Nack;
        case kStatus_I3C_Timeout: return nv::i3c::Driver::Status::Timeout;
        default                 : return nv::i3c::Driver::Status::Error;
    }
}

bool nv::i3c::Driver::ocp_query_interface_mastering(uint8_t address, bool& enable)
{
    constexpr uint8_t  Command = 0x25;
    nv::i2c::I2cBuffer write_buffer{};
    nv::i2c::I2cBuffer read_buffer{};
    write_buffer[0] = Command;
    auto status     = i2c(address,
                      std::span<uint8_t>(write_buffer.data(), 1),
                      std::span<uint8_t>(read_buffer.data(), 4));
    if (status != nv::i2c::I2cStatus::Ok) {
        return false;
    }
    enable = read_buffer[3] == 1 ? true : false;
    return true;
}

bool nv::i3c::Driver::ocp_enable_interface_mastering(uint8_t address)
{
    constexpr uint8_t  Command = 0x25;
    constexpr uint8_t  Length  = 0x03;
    nv::i2c::I2cBuffer write_buffer{};
    nv::i2c::I2cBuffer read_buffer{};
    write_buffer[0] = Command;
    write_buffer[1] = Length;
    write_buffer[2] = 0x00;
    write_buffer[3] = 0x00;
    write_buffer[4] = 0x01;
    auto status     = i2c(address,
                      std::span<uint8_t>(write_buffer.data(), 5),
                      std::span<uint8_t>(read_buffer.data(), 0));
    return status == nv::i2c::I2cStatus::Ok ? true : false;
}

bool nv::i3c::Driver::gpu_query_i3c_mode(uint8_t address, bool& i3c)
{
    constexpr uint8_t  Register = 0x00;
    bool               result   = false;
    nv::i2c::I2cBuffer write_buffer{};
    nv::i2c::I2cBuffer read_buffer{};
    write_buffer[0] = Register;
    auto status     = i2c(address,
                      std::span<uint8_t>(write_buffer.data(), 1),
                      std::span<uint8_t>(read_buffer.data(), 1));
    switch (status) {
        case nv::i2c::I2cStatus::Ok:
            i3c    = false;
            result = true;
            break;
        case nv::i2c::I2cStatus::Nak:
            i3c    = true;
            result = true;
            break;
        default: result = false;
    }
    return result;
}

bool nv::i3c::Driver::gpu_configure_cms1(uint8_t address)
{
    constexpr uint8_t  Command = 0x29;
    nv::i2c::I2cBuffer write_buffer{};
    nv::i2c::I2cBuffer read_buffer{};
    write_buffer[0] = Command;
    write_buffer[1] = 0x06;
    write_buffer[2] = 0x01;
    write_buffer[3] = 0x00;
    write_buffer[4] = 0x00;
    write_buffer[5] = 0x00;
    write_buffer[6] = 0x00;
    write_buffer[7] = 0x00;
    auto status     = i2c(address,
                      std::span<uint8_t>(write_buffer.data(), 8),
                      std::span<uint8_t>(read_buffer.data(), 0));
    return status == nv::i2c::I2cStatus::Ok ? true : false;
}

bool nv::i3c::Driver::gpu_program_cms1(uint8_t address, std::span<uint8_t> buffer)
{
    constexpr uint8_t  Command = 0x2b;
    nv::i2c::I2cBuffer write_buffer{};
    nv::i2c::I2cBuffer read_buffer{};
    write_buffer[0] = Command;
    write_buffer[1] = static_cast<uint8_t>(buffer.size());
    std::memcpy(write_buffer.data() + 2, buffer.data(), buffer.size());
    auto status = i2c(address,
                      std::span<uint8_t>(write_buffer.data(), 2 + buffer.size()),
                      std::span<uint8_t>(read_buffer.data(), 0));
    return status == nv::i2c::I2cStatus::Ok ? true : false;
}

bool nv::i3c::Driver::gpu_read_cms1(uint8_t address, std::span<uint8_t> buffer)
{
    constexpr uint8_t  Command = 0x2b;
    nv::i2c::I2cBuffer write_buffer{};
    nv::i2c::I2cBuffer read_buffer{};
    write_buffer[0] = Command;
    auto status     = i2c(address,
                      std::span<uint8_t>(write_buffer.data(), 1),
                      std::span<uint8_t>(read_buffer.data(), buffer.size() + 1));
    if (status == nv::i2c::I2cStatus::Ok) {
        std::memcpy(buffer.data(), read_buffer.data() + 1, buffer.size());
        return true;
    }
    return false;
}